src/config/Reports/БазовыйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>БазовыйОтчет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненнаяНастройка</Name>
					<Comment>(для отчетов на базе типового)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СохраненныеНастройкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРасшифровка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьТаблицуСтруктурыНастроек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоиНастройки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСистемыОтчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиСистемыОтчеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеРасшифровкиТМП</Name>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураОтчетаТаблица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГруппировки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипДетализацииСтандартныхОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/config/Reports/БазовыйОтчет/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПрименитьНастройкуСервер(СохраненнаяНастройка,СтандартнаяОбработка) Экспорт
	КомпоновкаДанныхСервер.ПрименитьСохраненнуюНастройку(ЭтаФорма, ИмяОтчета, СохраненнаяНастройка, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ПериодичностьПриИзмененииСервер()
	КомпоновкаДанныхСервер.ПериодичностьПриИзмененииСервер(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура СоздатьДеревоДоступныхПолейСервер()
	КомпоновкаДанныхСервер.СоздатьДеревоДоступныхПолейСервер(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПрименитьНастройкуПоляСервер(ТекСтрокаИдентификатор, ПоляГруппировки)
	КомпоновкаДанныхСервер.ПрименитьНастройкуПоляСервер(ЭтаФорма, ТекСтрокаИдентификатор, ПоляГруппировки);
КонецПроцедуры

&НаКлиенте
Процедура СохраненныеНастройкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПрименитьНастройкуСервер(ВыбраннаяСтрока,СтандартнаяОбработка);
	КомпоновкаДанныхКлиент.УстановитьВидимостьСтруктурыОтчета(ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметровОтчета() Экспорт
	Если Отчет.ОтображатьТаблицуСтруктурыНастроек Тогда
		КомпоновкаДанныхСервер.ПолучитьНастройкиОтчетаПоТаблицеНастроек(Отчет);
	КонецЕсли;
		
	ОтчетОбъект 		= ЭтаФорма.РеквизитФормыВЗначение("Отчет");
	СтруктураНастроек 	= КомпоновкаДанныхСервер.ПолучитьСтруктуруПараметровТиповогоОтчета(ОтчетОбъект);
	Возврат СтруктураНастроек;
КонецФункции

&НаКлиенте
Процедура СохранитьНастройку(Команда)
	
	СтруктураНастроек = ПолучитьСтруктуруПараметровОтчета();
	КомпоновкаДанныхКлиент.СохранитьНастройку(ЭтаФорма,СтруктураНастроек);
КонецПроцедуры

&НаКлиенте
Процедура МоиНастройки(Команда)
	КомпоновкаДанныхКлиент.МоиНастройки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьМесяц(Команда)
	КомпоновкаДанныхКлиент.ИзменитьПериодОтчета(ЭтаФорма,Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда) Экспорт
	КомпоновкаДанныхКлиент.Сформировать(ЭтаФорма);
КонецПроцедуры	

&НаКлиенте
Процедура Редактировать(Команда)
	КомпоновкаДанныхКлиент.Редактировать(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Заголовки(Команда)
	КомпоновкаДанныхКлиент.Заголовки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Сетка(Команда)
	КомпоновкаДанныхКлиент.Сетка(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Портрет(Команда)
	КомпоновкаДанныхКлиент.Портрет(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Ландшафт(Команда)
	КомпоновкаДанныхКлиент.Ландшафт(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКак(Команда)
	РаботаСФайламиКлиент.СохранитьКак(Результат,Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьУровень(Команда)
	Результат.ПоказатьУровеньГруппировокСтрок(Число(СтрЗаменить(Команда.Имя,"ПоказатьУровень","")) - 1);
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтборы(Команда)
	КомпоновкаДанныхКлиент.ОтключитьОчиститьОтборыИерархически(Отчет.КомпоновщикНастроек.Настройки.Отбор);
КонецПроцедуры

&НаКлиенте
Процедура ПодробноНажатие(Команда)
	КомпоновкаДанныхКлиент.ПодробноНажатие(ЭтаФорма, Команда.Имя);
	
	ПодробноНажатиеНаСервере(Команда.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодробноНажатиеНаСервере(ИмяКоманды)
	Если ИмяКоманды = "ПодробноОтключить" Тогда
		КомпоновкаДанныхСервер.ПреобразоватьНастройкиОтчетаКТабличномуВиду(ЭтаФорма.Отчет);
	Иначе
		КомпоновкаДанныхСервер.ПолучитьНастройкиОтчетаПоТаблицеНастроек(ЭтаФорма.Отчет);
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ДобавитьПоле(Команда)
	СоздатьДеревоДоступныхПолейСервер();
	КомпоновкаДанныхКлиент.ДобавитьПоле(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеПоля(Команда)
	КомпоновкаДанныхКлиент.ОтметитьВсеПоля(ЭтаФорма, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура СтруктураОтчетаТаблицаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	ДобавитьПоле(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	ПериодичностьПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураОтчетаТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.СтруктураОтчетаТаблицаПредставление Тогда
		
		СоздатьДеревоДоступныхПолейСервер();
		
		ТекСтрока = Отчет.СтруктураОтчетаТаблица.НайтиПоИдентификатору(ВыбраннаяСтрока);
		РезультатОткрытия = Неопределено;
		
		ОткрытьФорму("ОбщаяФорма.ФормаНастроекПолейГруппировкиУправляемая", Новый Структура("ПолеСтрока, ОтчетОбъект, КомпоновщикНастроек, АдресДереваДоступныхПолей", ТекСтрока.Поле, Отчет, Отчет.КомпоновщикНастроек, АдресДереваДоступныхПолей),
			ЭтаФорма,,,, Новый ОписаниеОповещения("СтруктураОтчетаТаблицаВыборЗавершение", ЭтотОбъект, Новый Структура("ТекСтрока", ТекСтрока)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураОтчетаТаблицаВыборЗавершение(Результат1, ДополнительныеПараметры) Экспорт
	
	РезультатОткрытия = КомпоновкаДанныхКлиент.СтруктураОтчетаТаблицаВыборЗавершение(ЭтаФорма, Результат1, ДополнительныеПараметры);
	Если РезультатОткрытия <> Неопределено Тогда
		ПрименитьНастройкуПоляСервер(ДополнительныеПараметры.ТекСтрока.ПолучитьИдентификатор(), РезультатОткрытия);
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Параметры.Свойство("НастройкаСистемыОтчет") Тогда
		Отчет.НастройкаСистемыОтчет = ЭтаФорма.Параметры.НастройкаСистемыОтчет;
		//НастройкаСистемыОтчетПриИзмененииНаСервере();
	КонецЕсли;
	
	КомпоновкаДанныхСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	//ФормыКлиентСервер.УстановитьЗначениеОтбора(СохраненныеНастройки, "НастраиваемыйОбъект", Отчет.НастройкаСистемыОтчет);
	Элементы.СохраненныеНастройки.ТекущаяСтрока = ЭтаФорма.Отчет.СохраненнаяНастройка;
	//ПрименитьНастройкуСервер(Элементы.СохраненныеНастройки.ТекущаяСтрока, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	//КомпоновкаДанныхКлиент.ОбработкаРасшифровкиТиповогоОтчета(ДанныеРасшифровки, Расшифровка, СтандартнаяОбработка, ЭтаФорма);
	КомпоновкаДанныхКлиент.ОбработкаРасшифровкиТиповогоОтчета(ДанныеРасшифровки, Расшифровка, СтандартнаяОбработка, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ВариантМодифицирован = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	КомпоновкаДанныхКлиент.ОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ИсточникВыбора);
	
	Если ТипЗнч(ИсточникВыбора)  = Тип("УправляемаяФорма")
		И ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаВыбораДоступногоПоляКомпоновщикаНастроекУправляемая" Тогда
		
		Если ВыбранноеЗначение <> Неопределено Тогда
			
			ПолеКомпоновки = ВыбранноеЗначение;
			
			УдалитьИзВременногоХранилища(ЭтаФорма.АдресДереваДоступныхПолей);
			
			///////////////////////////////////////////////////////////////////////////////
			
			Если ТипЗнч(ПолеКомпоновки) = Тип("ПолеКомпоновкиДанных") Тогда
				ДобавитьПолеГруппировкиСервер(ПолеКомпоновки);
			КонецЕсли;	
			
		КонецЕсли;		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеГруппировкиСервер(ПолеКомпоновки)
	ИдентификаторТекСтроки = Неопределено;
	КомпоновкаДанныхСервер.ДобавитьПолеГруппировкиСервер(Отчет, ПолеКомпоновки, ИдентификаторТекСтроки);
	Элементы.СтруктураОтчетаТаблица.ТекущаяСтрока = ИдентификаторТекСтроки;
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтчетаПриИзменении(Элемент)
	КомпоновкаДанныхКлиент.ПериодОтчетаПриИзменении(ЭтаФорма, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтчетаНажатие(Команда)
	КомпоновкаДанныхКлиент.ПериодОтчетаНажатие(ЭтаФорма, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизации(Элемент)
	КомпоновкаДанныхКлиент.ВычислитьСуммуВыделенныхЯчеек(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСистемыОтчетПриИзменении(Элемент) Экспорт
	НастройкаСистемыОтчетПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НастройкаСистемыОтчетПриИзмененииНаСервере()
	
	//ЗаданныйЗаголовок 		= Отчет.НастройкаСистемыОтчет.Заголовок;
	//ЭтаФорма.Автозаголовок 	= Ложь;
	//ЭтаФорма.Заголовок 		= ?(ПустаяСтрока(ЗаданныйЗаголовок), СокрЛП(Отчет.НастройкаСистемыОтчет.Наименование), ЗаданныйЗаголовок);
	//Элементы.НастройкаСистемыОтчет.Доступность = РольДоступна("ПолныйДоступ");
	
	//ПриСозданииНаСервере(Ложь, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЭтаФорма.ДополнительныеСвойства.Свойство("ЭтоРасшифровка") или ЭтаФорма.ДополнительныеСвойства.ЭтоРасшифровка = Ложь Тогда
		СохраненныеНастройкиВыбор(Элементы.СохраненныеНастройки, ЭтаФорма.Отчет.СохраненнаяНастройка, Неопределено, Ложь);
	КонецЕсли;
КонецПроцедуры
